# running in formal_bmc/src/
read -formal -sv BranchAddressGenFormal.sv
prep -top BranchAddressGenFormal

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
