# running in conditionFormal_bmc/src/
read -formal -sv BranchConditionGenFormal.sv
prep -top BranchConditionGenFormal

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
