# running in addressFormalBug_bmc/src/
read -formal -sv BranchAddressGenFormalBug.sv
prep -top BranchAddressGenFormalBug

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
